Дипломная/src/Documents/ВКМ_НачислениеПремии/ВКМ_НачислениеПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Дипломная/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

Дипломная/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная/src/Documents/ВКМ_НачислениеПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_Удержания.Записывать = Истина;

    Для Каждого Строка Из СписокСотрудников Цикл

        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
        Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
        Движение.БазовыйПериодКонец = КонецМесяца(Дата);
        Движение.Сумма = Строка.СуммаПремии;

		СтавкаНДФЛ = 0.13;
		СуммаНДФЛ = Строка.СуммаПремии * СтавкаНДФЛ;

        ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеНДФЛ.ПериодРегистрации = Дата; 
		ДвижениеНДФЛ.Сотрудник = Строка.Сотрудник;
        ДвижениеНДФЛ.БазовыйПериодНачало = НачалоМесяца(Дата);
        ДвижениеНДФЛ.БазовыйПериодКонец = КонецМесяца(Дата);
        ДвижениеНДФЛ.Сумма = СуммаНДФЛ;

	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
    Движения.ВКМ_Удержания.Записать();
	
	СформироватьДвиженияВзаиморасчеты();
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчеты()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
                   |	СУММА(ВКМ_ДополнительныеНачисления.Сумма) КАК СуммаДоп,
                   |	ВКМ_ДополнительныеНачисления.Регистратор КАК Регистратор
                   |ПОМЕСТИТЬ ВТ_ДопНачисления
                   |ИЗ
                   |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
                   |ГДЕ
                   |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ВКМ_ДополнительныеНачисления.Сотрудник,
                   |	ВКМ_ДополнительныеНачисления.Регистратор
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |	ВКМ_Удержания.Сотрудник КАК Сотрудник,
                   |	СУММА(ВКМ_Удержания.Сумма) КАК СуммаУдержаний,
                   |	ВКМ_Удержания.Регистратор КАК Регистратор
                   |ПОМЕСТИТЬ ВТ_Удержания
                   |ИЗ
                   |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
                   |ГДЕ
                   |	ВКМ_Удержания.Регистратор = &Ссылка
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ВКМ_Удержания.Сотрудник,
                   |	ВКМ_Удержания.Регистратор
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |	ВТ_ДопНачисления.Сотрудник КАК Сотрудник,
                   |	ЕСТЬNULL(ВТ_ДопНачисления.СуммаДоп, 0) КАК СуммаДоп,
                   |	ЕСТЬNULL(ВТ_Удержания.СуммаУдержаний, 0) КАК СуммаУдержаний
                   |ИЗ
                   |	ВТ_ДопНачисления КАК ВТ_ДопНачисления
                   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
                   |		ПО ВТ_ДопНачисления.Сотрудник = ВТ_Удержания.Сотрудник
                   |			И ВТ_ДопНачисления.Регистратор = ВТ_Удержания.Регистратор
                   |
                   |СГРУППИРОВАТЬ ПО
                   |	ВТ_ДопНачисления.Сотрудник,
                   |	ЕСТЬNULL(ВТ_ДопНачисления.СуммаДоп, 0),
                   |	ЕСТЬNULL(ВТ_Удержания.СуммаУдержаний, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл	
		
		ОбщаяСумма = Выборка.СуммаДоп - Выборка.СуммаУдержаний;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Сумма = ОбщаяСумма;
		
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
